src/DataProcessors/ОткрытиЗакрытиеСменыКасса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ОткрытиЗакрытиеСменыКасса</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/AccumulationRegisters/ДенежныеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеОперации</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/InformationRegisters/ЗаказДопИнф.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЗаказДопИнф</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПротоколРасчетов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПротоколРасчетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаАвторизации</Name>
					<Comment>дата/время регистрации карты лояльности в заказе</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ВозвратДопИнф.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ВозвратДопИнф</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПротоколРасчетов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПротоколРасчетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Возврат</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Возврат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СтатусыЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Открыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удален</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ПротоколРасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПротоколРасчетов</Name>
			<Comment>факт оплаты заказа</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеОперации</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Смена</Name>
					<Comment>для группировки по сменам</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеСмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
						<v8:Type>cfg:DocumentRef.Возврат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаРеализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтогСуммаФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Неучетный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБонусов</Name>
					<Comment>к начислению по заказу</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗапросаЕГАИС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьЕГАИС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>900</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗапросаЕГАИС_Отмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавленыЗаписиВexcise</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветФН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветМодуляЕГАИС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветМодуляЕГАИС_Отмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУдалосьОтправитьОтменуВегаис</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>идТранзакцииПлатежнойСистемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Слип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранзакцияПлатежнойСистемыОтменена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фискализирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассоваяСмена</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Касса_ОткрытиеСмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧека</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСмены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодвалЧека</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЛояльности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЧекаЛояльность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЛояльности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Протокол</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДействияПриОплате</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОплаты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыОплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Остаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФакт</Name>
							<Comment>сумма за вычетом сдачи (для наличных)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКарты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/DataProcessors/ОткрытиЗакрытиеСменыКасса/Ext/ObjectModule.bsl
&НаКлиенте
Функция ОткрытьСмену() Экспорт
	глПараметрыРМ = глПараметрыРМ;
	ДокСмены = Обработки.ОткрытиЗакрытиеСменыКасса.ПолучитьСменуКассы();
	Если не ДокСмены.Пустая() Тогда
		ИнтерфейсРМ.ВопросПредупреждение("Ошибка открытия смены","Смена уже открыта!","Смена № " + ДокСмены.НомерСмены + " от " + Формат(ДокСмены.Дата,"ДЛФ=DD"),"","ОК","");
		Возврат ложь;
	КонецЕсли;
	
	СменаТТ = ИнтерфейсРМ.ТекущаяСмена();
	Если СменаТТ.Пустая() Тогда
		ИнтерфейсРМ.ВопросПредупреждение("Ошибка открытия смены","Смена ТТ не открыта!","","","ОК","");
		Возврат ложь;
	КонецЕсли;
	Если НачалоДня(СменаТТ.Дата) <> НачалоДня(ТекущаяДатаНаСервере()) Тогда
		ИнтерфейсРМ.ВопросПредупреждение("Ошибка открытия смены","Предыдущая смена ТТ не закрыта!","","","ОК","");
		Возврат ложь;
	КонецЕсли;
	
	ККМ=глПараметрыРМ.ККМ.ПолучитьОбъект();
	Обработка_ККМ=Обработка_ККМ;
	ИнициализацияТО(ККМ,Обработка_ККМ,глПараметрыРМ);
	ВхПараметры = новый Структура;
	ВыхПараметры = новый Структура;
	ВхПараметры.Вставить("Кассир",Строка(глПользователь));
	ВхПараметры.Вставить("ККМСсылка",ККМ.Ссылка);
	
	Попытка
		Ответ = Обработка_ККМ.ВыполнитьКоманду("ОткрытьСмену",ВхПараметры,ВыхПараметры);
	Исключение
		ИнтерфейсРМ.ВопросПредупреждение("Ошибка", "Ошибка ККМ", ОписаниеОшибки(), "","ОК", "");
		Возврат Ложь;
	КонецПопытки;
	
	
	Если не Ответ Тогда
		Если ВыхПараметры.Свойство("ОписаниеОшибки") Тогда
			ТекстОшибки = "";
			ОписаниеОшибки = ВыхПараметры.ОписаниеОшибки;
			Для к = 0 по ОписаниеОшибки.Количество()-1 Цикл
				 ТекстОшибки = ТекстОшибки + ОписаниеОшибки[к];
			КонецЦикла;
			ИнтерфейсРМ.ВопросПредупреждение("Ошибка Открытия смены",ТекстОшибки,"","","ОК","");
		КонецЕсли;
	КонецЕсли;
	
	Если глПараметрыРМ.ККМЕстьДоп тогда
		Попытка
			ККМ1 = глПараметрыРМ.ККМСписокДоп[0].Значение.ПолучитьОбъект();
			Обработка_ККМ1 = Неопределено;
			ИнициализацияТО(ККМ1, Обработка_ККМ1, глПараметрыРМ);
			ВхПараметры = новый Структура;
			ВыхПараметры = новый Структура;
			ВхПараметры.Вставить("Кассир",Строка(глПользователь));
			ВхПараметры.Вставить("ККМСсылка",ККМ1.Ссылка);
			
			Попытка
				Ответ = Обработка_ККМ1.ВыполнитьКоманду("ОткрытьСмену",ВхПараметры,ВыхПараметры);
			Исключение
				ИнтерфейсРМ.ВопросПредупреждение("Ошибка", "Ошибка ККМ", ОписаниеОшибки(), "","ОК", "");
				Возврат Ложь;
			КонецПопытки;
			
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	// он формируется в команде - открыть смену
	//// формирование документа Открытие смены Касса
	//Если Ответ Тогда
	//	Если Обработки.ОткрытиЗакрытиеСменыКасса.ПолучитьСменуКассы().Пустая() Тогда
	//		ОткрытиеСмены = Документы.Касса_ОткрытиеСмены.СоздатьДокумент();
	//		ОткрытиеСмены.Автор = глПользователь;
	//		ОткрытиеСмены.Дата = ТекущаяДатаНаСервере();
	//		ОткрытиеСмены.СменаТТ = СменаТТ;
	//		ОткрытиеСмены.Касса = глПараметрыРМ.ККМ;
	//		ОткрытиеСмены.КассаНомер = глПараметрыРМ.ККМ.КодСуп;
	//		ОткрытиеСмены.КассаЗаводскойНомер = глПараметрыРМ.ККМ.ЗаводскойНомер;
	//		ОткрытиеСмены.НомерСмены = ВыхПараметры.НомерСмены;
	//		ОткрытиеСмены.НомерДокумента = ВыхПараметры.НомерЧека;
	//		ОткрытиеСмены.РабочееМесто = глРабочееМесто;
	//		
	//		Если ИнтерфейсРМ.ПопыткаДействияСОбъектом(ОткрытиеСмены,"Объект.Записать(РежимЗаписиДокумента.Проведение)") Тогда
	//			Если ЭтоПерваяКассоваяСмена() Тогда
	//				Попытка
	//					УправлениеСерверамиПриложений.СоздатьЛокальнуюФайловуюБазу();	
	//				Исключение
	//					ЗарегистрироватьСобытие("Резервирование.Ошибка создания локальной базы", УровеньЖурналаРегистрации.Ошибка, , ОткрытиеСмены.Ссылка, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	//				КонецПопытки;
	//			КонецЕсли;
	//		КонецЕсли;
	//					
	//	КонецЕсли;
	//КонецЕсли;
		
	Возврат Ответ;
	
КонецФункции

&НаКлиенте
Функция ЗакрытьСмену() Экспорт 
	
	Если ПроцедурыОбменаДанными.ОпределитьЭтаИнформационнаяБазаФайловая() Тогда
		ИнтерфейсРМ.ВопросПредупреждение("Ошибка закрытия смены","В аварийном режиме работы закрытие смены запрещено!","","","ОК","");
		Возврат ложь;
	КонецЕсли;

	ЕстьОшибки = Ложь;
	
	Если глПараметрыРМ.ККМЕстьДоп тогда
		ИндексККМ = глПараметрыРМ.ККМСписокДоп.Количество() + 1
	Иначе
		ИндексККМ = 1;
	КонецЕсли;
		Попытка
			Для ИндККМ = 1 по ИндексККМ Цикл
				Если ИндККМ = 1 Тогда
					ККМ=глПараметрыРМ.ККМ.ПолучитьОбъект();
				Иначе
					ККМ = глПараметрыРМ.ККМСписокДоп[0].Значение.ПолучитьОбъект();
				КонецЕсли;
				Обработка_ККМ=Обработка_ККМ;
				ИнициализацияТО(ККМ,Обработка_ККМ,глПараметрыРМ);
				
				СменаТТ = ИнтерфейсРМ.ТекущаяСмена(ККМ.Фирма.МестоРеализации);
				Если СменаТТ.Пустая() Тогда
					ИнтерфейсРМ.ВопросПредупреждение("Ошибка закрытия смены","Смена ТТ по " + ККМ.Фирма.МестоРеализации.Наименование + " не открыта!","","","ОК","");
					ЕстьОшибки = Истина;
					Продолжить;//Возврат ложь;
				КонецЕсли;
				
				ПростоЗакрыть = Ложь;
				СменаКасса = Обработки.ОткрытиЗакрытиеСменыКасса.ПолучитьСменуКассыПоНомеруКассы(ТекущаяДата(),ККМ.КодСуп);
				Если СменаКасса.Пустая() Тогда
					// добавим проверку на смену из ФН если это он
					Если СтрНайти(Врег(ккм.ИмяОбработки),"ФР_АТОЛ1") <> 0 Тогда
						ВхПар = Новый структура;
						ВыхПар = Новый Структура;
						Ответ = Обработка_ККМ.ВыполнитьКоманду("ПолучитьТекущееСостояние",ВхПар,ВыхПар);
						Если Ответ Тогда
							Если ВыхПар.Свойство("СменаОткрыта") и ВыхПар.СменаОткрыта Тогда
								// получим последнюю открытую смену по ККМ
								СменаКасса = Обработки.ОткрытиЗакрытиеСменыКасса.ПолучитьПоследнююНеЗакрытуюСменуПоНомеру(глПараметрыРМ.ККМ.КодСуп,ВыхПар.НомерСмены);
								Если не СменаКасса.пустая() ТОгда
									ПростоЗакрыть = Истина;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
					Иначе
						ИнтерфейсРМ.ВопросПредупреждение("Ошибка закрытия смены","Кассовая смена не открыта!","","","ОК","");
						ЕстьОшибки = Истина;
						Продолжить;//Возврат ложь;
					КонецЕсли;
				КонецЕсли;
		
	
				Если ИндККМ = 1 и ИнтерфейсРМ.ВопросПредупреждение("Вопрос", "Закрытие смены ККТ", "Выполнить закрытие смены?", "Да","","Esc=Нет") <> "Да" Тогда
					ЕстьОшибки = Истина;
					Продолжить;//Возврат ложь;
				КонецЕсли;
				//Если не СменаКасса.Пустая() и ПроверитьНаличиеДенегВКассе(СменаКасса) Тогда
				//	ИнтерфейсРМ.ВопросПредупреждение("Ошибка Закрытия смены","В кассе есть остаток денежных средств.","Перед закрытием смены сделайте изъятие","","ОК","");
				//	Возврат Ложь;
				//КонецЕсли;
				//ПроверитьИУдалитьПустыеЗаказы();
				Если ИндККМ = 1 Тогда
					Попытка
						ОбъектТерминал = глПараметрыРМ.ПлатежнаяСистема.ПолучитьОбъект();
						Обработка_ПС = Обработка_ПС;
						РезультатИнит = ИнициализацияТО(ОбъектТерминал, Обработка_ПС, глПараметрыРМ);
						ОтветПС = Истина;
						ОтветККТ = Истина;
					Исключение
						Если ИнтерфейсРМ.ВопросПредупреждение("Вопрос", "Ошибка платежного терминала" , "Продолжить выполнение?", "Да","","Esc=Нет") <> "Да" Тогда
							ЕстьОшибки = Истина;
							Продолжить;//Возврат ложь;
						КонецЕсли;
						ОтветПС = Ложь;
					КонецПопытки;
					ВхПараметры = новый Структура;
					ВыхПараметры = Новый Массив;
					
	
					Попытка
						ОтветПС = Обработка_ПС.ВыполнитьКоманду("ИтогиДняПоКартам",ВхПараметры, ВыхПараметры);
						
						Если не ОтветПС Тогда
							Если ИнтерфейсРМ.ВопросПредупреждение("Вопрос", "Ошибка платежного терминала |" + ВыхПараметры[0] , "Продолжить выполнение?", "Да","","Esc=Нет") <> "Да" Тогда
								ЕстьОшибки = Истина;
								Продолжить;//Возврат ложь;
							КонецЕсли;
						Иначе
							Если ОтветПС Тогда
								Строки = ВыхПараметры[0].Строки;
								
								
								//// сформируем записи в ext по закрытию смены по банку
								//Коннект = sql.ПодключитьсяКloyality_ext();
								//Если Коннект = Неопределено Тогда
								//	ЗарегистрироватьСобытие("Подключение к базе", УровеньЖурналаРегистрации.Ошибка,,,"ошибка подключения к серверу при записи Банковской смены");
								//Иначе			
								//	ТекстЗапроса = "
								//	|begin
								//	|Insert into [Loyality_ext].[dbo].[БанковскиеСмены]
								//	|			(Дата
								//	|			,ТТ
								//	|			,[НомерККМ]
								//	|			,[СлипЗакрытия]
								//	|			,[Сумма])
								//	|Values
								//	|			('&ДатаДок'
								//	|			,&КодТТ
								//	|			,&НомерККМ
								//	|			,'&СлипЗакрытия'
								//	|			,&Сумма)
								//	|end";
								//	
								//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ДатаДок",Формат(ТекущаяДата(),"ДФ='yyyyMMdd HH:mm:ss'; ДП='40010101 00:00:00'"));
								//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&КодТТ",формат(ККМ.Фирма.КодТТ,"ЧН=0; ЧГ=0"));
								//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&НомерККМ",Формат(ККМ.КодСуп,"ЧН=0; ЧГ=0"));
								//	СуммаИтого = 0;
								//	ТекстСлип = "";
								//	ТипБлока = 0;
								//	Для инд = 0 по Строки.Количество() - 1 Цикл
								//		СтрокаТекста = Строки[инд];
								//		СтрокаТекста = СтрЗаменить(СтрокаТекста,"""","""""");
								//		СтрокаТекста = СтрЗаменить(СтрокаТекста,"'","""""");
								//		ТекстСлип = ТекстСлип + СтрокаТекста + Символы.ПС;
								//		Если СтрНайти(ВРег(СтрокаТекста),"ОПЛАТА") <> 0 Тогда
								//			ТипБлока = 1;
								//		ИначеЕсли СтрНайти(ВРег(СтрокаТекста),"ВОЗВРАТ") <> 0 Тогда
								//			ТипБлока = -1;
								//		ИначеЕсли СтрНайти(ВРег(СтрокаТекста),"ОТМЕНА") <> 0 Тогда
								//			ТипБлока = 0;
								//		КонецЕсли;
								//		Если СтрНайти(ВРег(СтрокаТекста),"ВСЕГО ОПЕРАЦИЙ:") <> 0 Тогда
								//			Попытка
								//				СтрокаТекстаСумма = Строки[инд + 1];
								//				СуммаОп = Число(СокрЛП(СтрЗаменить(ВРег(СтрокаТекстаСумма),"НА СУММУ:","")));
								//			Исключение
								//				СуммаОп = 0;
								//			КонецПопытки;
								//			СуммаИтого = СуммаИтого + ТипБлока * СуммаОп;
								//		КонецЕсли;
								//	КонецЦикла;
								//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&СлипЗакрытия",ТекстСлип);
								//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&Сумма",формат(СуммаИтого,"ЧРД=.; ЧН=0; ЧГ=0"));
								//	
								//	
								//	Отказ = Ложь;
								//	ТекстОшибки = "";
								//	SQL.ВыполнитьЗапрос(Коннект, ТекстЗапроса, Отказ, ТекстОшибки);
								//	Если Отказ Тогда 
								//		ЗарегистрироватьСобытие("Запись закрытия смены по СБ", УровеньЖурналаРегистрации.Ошибка,,,ТекстОшибки);
								//	КонецЕсли;
								//КонецЕсли;
								
								// сформируем записи в ext по закрытию смены по банку
								Коннект = sql.ПодключитьсяКloyality_ext();
								Если Коннект = Неопределено Тогда
									ЗарегистрироватьСобытие("Подключение к базе", УровеньЖурналаРегистрации.Ошибка,,,"ошибка подключения к серверу при записи Банковской смены");
								Иначе			
									ТекстЗапроса = "
									|begin
									|Insert into [Loyality_ext].[dbo].[БанковскиеСмены]
									|			(Дата
									|			,ТТ
									|			,[НомерККМ]
									|			,[СлипЗакрытия]
									|			,[Сумма])
									|Values
									|			('&ДатаДок'
									|			,&КодТТ
									|			,&НомерККМ
									|			,'&СлипЗакрытия'
									|			,&Сумма)
									|end";
									
									ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ДатаДок",Формат(ТекущаяДата(),"ДФ='yyyyMMdd HH:mm:ss'; ДП='40010101 00:00:00'"));
									ТекстЗапросаОригинал = ТекстЗапроса;
									СуммаИтого = 0;
									ТекстСлип = "";
									ТипБлока = 0;
									НомерОтдела = -1;
									ТаблицаОтделов = новый ТаблицаЗначений;
									ТаблицаОтделов.Колонки.Добавить("Отдел");
									ТаблицаОтделов.Колонки.Добавить("Сумма");
									Для инд = 0 по Строки.Количество() - 1 Цикл
										СтрокаТекста = Строки[инд];
										СтрокаТекста = СтрЗаменить(СтрокаТекста,"""","""""");
										СтрокаТекста = СтрЗаменить(СтрокаТекста,"'","""""");
										Если СтрНайти(СтрокаТекста,"Отдел     :") Тогда
											НомерОтдела = НомерОтдела + 1;
											СтрТабл = ТаблицаОтделов.Добавить();
											СтрТабл.Отдел = НомерОтдела;
											СтрТабл.Сумма = СуммаИтого;
											СуммаИтого = 0;
											ТипБлока = 0;
										КонецЕсли;
										ТекстСлип = ТекстСлип + СтрокаТекста + Символы.ПС;
										Если СтрНайти(ВРег(СтрокаТекста),"ОПЛАТА") <> 0 Тогда
											ТипБлока = 1;
										ИначеЕсли СтрНайти(ВРег(СтрокаТекста),"ВОЗВРАТ") <> 0 Тогда
											ТипБлока = -1;
										ИначеЕсли СтрНайти(ВРег(СтрокаТекста),"ОТМЕНА") <> 0 Тогда
											ТипБлока = 0;
										КонецЕсли;
										Если СтрНайти(ВРег(СтрокаТекста),"ВСЕГО ОПЕРАЦИЙ:") <> 0 Тогда
											Попытка
												СтрокаТекстаСумма = Строки[инд + 1];
												СуммаОп = Число(СокрЛП(СтрЗаменить(ВРег(СтрокаТекстаСумма),"НА СУММУ:","")));
											Исключение
												СуммаОп = 0;
											КонецПопытки;
											СуммаИтого = СуммаИтого + ТипБлока * СуммаОп;
										КонецЕсли;
									КонецЦикла;
									
									Если ТаблицаОтделов.Количество() <> 0 тогда
										МассивККМ = Новый Массив;
										МассивККМ.Добавить(глПараметрыРМ.ККМ);
										Если глПараметрыРМ.ККМЕстьДоп Тогда
											МассивККМ.Добавить(глПараметрыРМ.ККМСписокДоп[0].Значение);
										КонецЕсли;
										Для каждого стрОтдел из ТаблицаОтделов Цикл
											ТекстЗапроса = ТекстЗапросаОригинал;
											ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&СлипЗакрытия",ТекстСлип);
											ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&Сумма",формат(стрОтдел.Сумма,"ЧРД=.; ЧН=0; ЧГ=0"));
											НомерККМ = Неопределено;
											ККМКодТТ = Неопределено;
											Для каждого эл из МассивККМ Цикл
												Если эл.Фирма.Мерчант = стрОтдел.Отдел Тогда
													НомерККМ = эл.КодСуп;
													ККМКодТТ = Эл.Фирма.КодТТ;
												КонецЕсли;
											КонецЦикла;
											Если НомерККМ = Неопределено Тогда
												ЗарегистрироватьСобытие("Запись закрытия смены по СБ", УровеньЖурналаРегистрации.Ошибка,,,"Ошибка определения номера ККМ по мерчанту");
												Продолжить;
											КонецЕсли;
											ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&НомерККМ",Формат(НомерККМ,"ЧН=0; ЧГ=0"));
											ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&КодТТ",формат(?(ККМКодТТ = Неопределено,ККМ.Фирма.КодТТ,ККМКодТТ),"ЧН=0; ЧГ=0"));
											Отказ = Ложь;
											ТекстОшибки = "";
											SQL.ВыполнитьЗапрос(Коннект, ТекстЗапроса, Отказ, ТекстОшибки);
											Если Отказ Тогда 
												ЗарегистрироватьСобытие("Запись закрытия смены по СБ", УровеньЖурналаРегистрации.Ошибка,,,ТекстОшибки);
											КонецЕсли;
										КонецЦикла;
									Иначе
										ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&СлипЗакрытия",ТекстСлип);
										ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&Сумма",формат(СуммаИтого,"ЧРД=.; ЧН=0; ЧГ=0"));
										ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&НомерККМ",Формат(ККМ.КодСуп,"ЧН=0; ЧГ=0"));
										ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&КодТТ",формат(ККМ.Фирма.КодТТ,"ЧН=0; ЧГ=0"));
										
										Отказ = Ложь;
										ТекстОшибки = "";
										SQL.ВыполнитьЗапрос(Коннект, ТекстЗапроса, Отказ, ТекстОшибки);
										Если Отказ Тогда 
											ЗарегистрироватьСобытие("Запись закрытия смены по СБ", УровеньЖурналаРегистрации.Ошибка,,,ТекстОшибки);
										КонецЕсли;
									КонецЕсли;
								КонецЕсли;
								ВхПараметры = новый Структура;
								ВхПараметры.Вставить("Строки",Строки);
								ВыхПараметры = новый Структура;
								ОтветККТ = Обработка_ККМ.ВыполнитьКоманду("ПечатьТекста",ВхПараметры,ВыхПараметры);
								Если не ОтветККТ Тогда
									Если ВыхПараметры.Свойство("Описаниеошибки") Тогда
										ТекстОшибки = "";
										ОписаниеОшибки = ВыхПараметры.ОписаниеОшибки;
										Для к = 0 по ОписаниеОшибки.Количество()-1 Цикл
											ТекстОшибки = ТекстОшибки + ОписаниеОшибки[к];
										КонецЦикла;
										Если СтрНайти(ТекстОшибки,"Отчет с гашением прерван. Вход в режим невозможен") = 0 Тогда
											Если СтрНайти(ТекстОшибки,"Смена превысила 24 часа") = 0 Тогда
												ИнтерфейсРМ.ВопросПредупреждение("Ошибка Закрытия смены",ТекстОшибки,"","","ОК","");
												ЕстьОшибки = Истина;
												Продолжить;//Возврат Ложь;
											КонецЕсли;
										КонецЕсли;
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
						
					Исключение
						Если ИнтерфейсРМ.ВопросПредупреждение("Вопрос", "Ошибка платежного терминала" , "Продолжить выполнение?", "Да","","Esc=Нет") <> "Да" Тогда
							ЕстьОшибки = Истина;
							Продолжить;//Возврат ложь;
						КонецЕсли;
						ОтветПС = Ложь;
					КонецПопытки;
				КонецЕсли;
				ВхПараметры = новый Структура;
				ВыхПараметры = новый Структура;
				
				// запомним номер смены
				Попытка 
					Ответ = Обработка_ККМ.ВыполнитьКоманду("ПолучитьТекущееСостояние",ВхПараметры,ВыхПараметры);
				Исключение
					ИнтерфейсРМ.ВопросПредупреждение("Ошибка", "Ошибка ККМ", ОписаниеОшибки(), "","ОК", "");
					ЕстьОшибки = Истина;
					Продолжить;//Возврат Ложь;
				КонецПопытки;
				
				Если не Ответ Тогда
					Если ВыхПараметры.Свойство("ОписаниеОшибки") Тогда
						ТекстОшибки = "";
						ОписаниеОшибки = ВыхПараметры.ОписаниеОшибки;
						Для к = 0 по ОписаниеОшибки.Количество()-1 Цикл
							ТекстОшибки = ТекстОшибки + ОписаниеОшибки[к];
						КонецЦикла;
						ИнтерфейсРМ.ВопросПредупреждение("Ошибка Закрытия смены",ТекстОшибки,"","","ОК","");
					КонецЕсли;
					ЕстьОшибки = Истина;
					Продолжить;//Возврат ложь;
				Иначе
					НомерСмены = ВыхПараметры.НомерСмены;
				КонецЕсли;
		
	
				ВхПараметры = новый Структура;
				ВыхПараметры = новый Структура;
				ВхПараметры.Вставить("Кассир",Строка(глПользователь));
				
				Попытка
					ОтветЗ = Обработка_ККМ.ВыполнитьКоманду("ЗакрытьСмену",ВхПараметры,ВыхПараметры);
				Исключение
					ИнтерфейсРМ.ВопросПредупреждение("Ошибка", "Ошибка ККМ", ОписаниеОшибки(), "","ОК", "");
					ЕстьОшибки = Истина;
					Продолжить;//Возврат Ложь;
				КонецПопытки;
				
				Если не ОтветЗ Тогда
					Если ВыхПараметры.Свойство("ОписаниеОшибки") Тогда
						ТекстОшибки = "";
						ОписаниеОшибки = ВыхПараметры.ОписаниеОшибки;
						Для к = 0 по ОписаниеОшибки.Количество()-1 Цикл
							ТекстОшибки = ТекстОшибки + ОписаниеОшибки[к];
						КонецЦикла;
						ИнтерфейсРМ.ВопросПредупреждение("Ошибка Закрытия смены",ТекстОшибки,"","","ОК","");
					КонецЕсли;
				КонецЕсли;
	
	
				ВхПараметры1 = новый Структура;
				ВыхПараметры1 = новый Структура;
				НомерСмены1 = НомерСмены;
				ИдетПечатьОтчета = ложь;
				
				Попытка 
					Ответ = Обработка_ККМ.ВыполнитьКоманду("ПолучитьТекущееСостояние",ВхПараметры1,ВыхПараметры1);
				Исключение
					ИнтерфейсРМ.ВопросПредупреждение("Ошибка", "Ошибка ККМ", ОписаниеОшибки(), "","ОК", "");
					ЕстьОшибки = Истина;
					Продолжить;//Возврат Ложь;
				КонецПопытки;
				
				Если не Ответ Тогда
					Если ВыхПараметры1.Свойство("ОписаниеОшибки") Тогда
						ТекстОшибки = "";
						ОписаниеОшибки = ВыхПараметры1.ОписаниеОшибки;
						Для к = 0 по ОписаниеОшибки.Количество()-1 Цикл
							ТекстОшибки = ТекстОшибки + ОписаниеОшибки[к];
						КонецЦикла;
						ИнтерфейсРМ.ВопросПредупреждение("Ошибка Закрытия смены",ТекстОшибки,"","","ОК","");
					КонецЕсли;
					ЕстьОшибки = Истина;
					Продолжить;//Возврат ложь;
				Иначе
					НомерСмены1 = ВыхПараметры1.НомерСмены;
					ИдетПечатьОтчета = ВыхПараметры1.НомерДокумента = 0;
				КонецЕсли;
	
	
				// формирование документа Закрытия смены Касса
				Если ОтветЗ Тогда
					ЗакрытиеСмены = Обработки.ОткрытиЗакрытиеСменыКасса.ПолучитьДокументЗакрытияСмены(СменаКасса).ПолучитьОбъект();//Документы.Касса_ЗакрытиеСмены.СоздатьДокумент();
					ЗакрытиеСмены.Автор = глПользователь;
					ЗакрытиеСмены.Дата = ТекущаяДатаНаСервере();
					ЗакрытиеСмены.СменаТТ =  СменаТТ;
					ЗакрытиеСмены.СменаКассы = СменаКасса;
					ЗакрытиеСмены.ПараметрыСмены = Новый ХранилищеЗначения(ВыхПараметры);
					ЗакрытиеСмены.РабочееМесто = глРабочееМесто;
					ЗакрытиеСмены.Совпало = ПроверитьСуммы(ВыхПараметры,глРабочееМесто,СменаКасса); // ??????????????
					
					ИнтерфейсРМ.ПопыткаДействияСОбъектом(ЗакрытиеСмены,"Объект.Записать(РежимЗаписиДокумента.Запись)");
					Если не ИнтерфейсРМ.ПопыткаДействияСОбъектом(ЗакрытиеСмены,"Объект.Записать(РежимЗаписиДокумента.Проведение)") Тогда
						//Ответ = Ложь;
					КонецЕсли;
					Если глПараметрыРМ.Свойство("НомерТекущегоЧека") Тогда
						глПараметрыРМ.НомерТекущегоЧека = 1;
					КонецЕсли;
				КонецЕсли;
	
				Если (НомерСмены < НомерСмены1 или ИдетПечатьОтчета) и не ОтветЗ Тогда // смена в ФН закрылась и нет параметров по смене
					ВхПараметры1 = новый Структура;
					ВыхПараметры1 = новый Структура;
					Попытка 
						Ответ = Обработка_ККМ.ВыполнитьКоманду("ПолучитьПараметрыСмены",ВхПараметры1,ВыхПараметры1);
					Исключение
						ИнтерфейсРМ.ВопросПредупреждение("Ошибка", "Ошибка ККМ", ОписаниеОшибки(), "","ОК", "");
						ЕстьОшибки = Истина;
						Продолжить;//Возврат Ложь;
					КонецПопытки;
					Если ответ Тогда
						ЗакрытиеСмены = Обработки.ОткрытиЗакрытиеСменыКасса.ПолучитьДокументЗакрытияСмены(СменаКасса).ПолучитьОбъект();//Документы.Касса_ЗакрытиеСмены.СоздатьДокумент();
						ЗакрытиеСмены.Автор = глПользователь;
						ЗакрытиеСмены.Дата = ТекущаяДатаНаСервере();
						ЗакрытиеСмены.СменаТТ =  СменаТТ;
						ЗакрытиеСмены.СменаКассы = СменаКасса;
						ЗакрытиеСмены.ПараметрыСмены = Новый ХранилищеЗначения(ВыхПараметры1);
						ЗакрытиеСмены.РабочееМесто = глРабочееМесто;
						ЗакрытиеСмены.Совпало = ПроверитьСуммы(ВыхПараметры1,глРабочееМесто,СменаКасса);
						
						ИнтерфейсРМ.ПопыткаДействияСОбъектом(ЗакрытиеСмены,"Объект.Записать(РежимЗаписиДокумента.Запись)");
						Если не ИнтерфейсРМ.ПопыткаДействияСОбъектом(ЗакрытиеСмены,"Объект.Записать(РежимЗаписиДокумента.Проведение)") Тогда
							//Ответ = Ложь;
						КонецЕсли;
						Если глПараметрыРМ.Свойство("НомерТекущегоЧека") Тогда
							глПараметрыРМ.НомерТекущегоЧека = 1;
						КонецЕсли;
						
					Иначе
						Если ВыхПараметры1.Свойство("ОписаниеОшибки") Тогда
							ТекстОшибки = "";
							ОписаниеОшибки = ВыхПараметры1.ОписаниеОшибки;
							Для к = 0 по ОписаниеОшибки.Количество()-1 Цикл
								ТекстОшибки = ТекстОшибки + ОписаниеОшибки[к];
							КонецЦикла;
							ИнтерфейсРМ.ВопросПредупреждение("Ошибка получения параметров Закрытия смены",ТекстОшибки,"","","ОК","");
						КонецЕсли;
						ЕстьОшибки = Истина;
						Продолжить;//Возврат ложь;
					КонецЕсли;
				КонецЕсли;
	
	
				Попытка
					Ответ = Обработка_ККМ.ВыполнитьКоманду("ОткрытьДенежныйЯщик",ВхПараметры,ВыхПараметры);
				Исключение
					ИнтерфейсРМ.ВопросПредупреждение("Ошибка", "Ошибка ККМ", ОписаниеОшибки(), "","ОК", "");
					ЕстьОшибки = Истина;
					Продолжить;//Возврат Ложь;
				КонецПопытки;
	
				Если не Ответ Тогда
					Если ВыхПараметры.Свойство("ОписаниеОшибки") Тогда
						ТекстОшибки = "";
						ОписаниеОшибки = ВыхПараметры.ОписаниеОшибки;
						Для к = 0 по ОписаниеОшибки.Количество()-1 Цикл
							ТекстОшибки = ТекстОшибки + ОписаниеОшибки[к];
						КонецЦикла;
						ИнтерфейсРМ.ВопросПредупреждение("Ошибка открытия денежного ящика",ТекстОшибки,"","","ОК","");
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		Исключение
		КонецПопытки;
	//КонецЕсли;		
	Возврат ЕстьОшибки; //Ответ;
КонецФункции

Функция ПроверитьНаличиеДенегВКассе(СменаКасса)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ДенежныеОперации.Сумма) КАК Сумма
	               |ИЗ
	               |	РегистрНакопления.ДенежныеОперации КАК ДенежныеОперации
	               |ГДЕ
	               |	ДенежныеОперации.Период МЕЖДУ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) И КОНЕЦПЕРИОДА(&Период, ДЕНЬ)
	               |	И ВЫБОР
	               |			КОГДА ДенежныеОперации.Регистратор ССЫЛКА Документ.ПротоколРасчетов
	               |				ТОГДА ДенежныеОперации.Регистратор.КассоваяСмена.НомерСмены = &НомерСмены
	               |			ИНАЧЕ ДенежныеОперации.Регистратор.СменаКассы.НомерСмены = &НомерСмены
	               |		КОНЕЦ
	               |	И ДенежныеОперации.ККМ = &ККМ";
	Запрос.УстановитьПараметр("Период",ТекущаяДатаНаСервере());
	//Запрос.УстановитьПараметр("РабочееМесто",глРабочееМесто);
	Запрос.УстановитьПараметр("ККМ",СменаКасса.Касса);
	Запрос.УстановитьПараметр("НомерСмены",СменаКасса.НомерСмены);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		Возврат ложь;
	Иначе
		Выборка.Следующий();
		Если Выборка.Сумма <> 0 Тогда
			Возврат Истина;
		Иначе
			Возврат ложь;
		КонецЕсли;
	КонецЕсли;
КонецФункции

Процедура ПроверитьИУдалитьПустыеЗаказы()
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(ЗаказТовары.Ссылка.Ссылка, ЗНАЧЕНИЕ(Документ.Заказ.ПустаяСсылка)) КАК Ссылка,
	               |	КОЛИЧЕСТВО(ЗаказТовары.НомерСтроки) КАК НомерСтроки
	               |ИЗ
	               |	РегистрСведений.ЗаказДопИнф КАК ЗаказДопИнф
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заказ.Товары КАК ЗаказТовары
	               |		ПО ЗаказДопИнф.Заказ = ЗаказТовары.Ссылка
	               |			И (ЗаказДопИнф.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказа.Открыт))
	               |ГДЕ
	               |	НАЧАЛОПЕРИОДА(ЗаказДопИнф.Заказ.Дата, ДЕНЬ) = &ТекДата
	               |	И ЗаказДопИнф.Заказ.РабочееМесто = &РабочееМесто
	               |	И НЕ ЗаказДопИнф.Заказ.ПометкаУдаления
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказТовары.Ссылка.Ссылка
	               |
	               |ИМЕЮЩИЕ
	               |	КОЛИЧЕСТВО(ЗаказТовары.НомерСтроки) = 0";
	Запрос.УстановитьПараметр("ТекДата",НачалоДня(ТекущаяДатаНаСервере()));
	глРабочееМесто=глРабочееМесто;
	Запрос.УстановитьПараметр("РабочееМесто",глРабочееМесто);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ссылка.пустая() Тогда 
			Продолжить;
		КонецЕсли;
		Рег = РегистрыСведений.ЗаказДопИнф.СоздатьМенеджерЗаписи();
		Рег.Заказ = Выборка.Ссылка;
		Рег.Прочитать();
		Рег.Статус = Перечисления.СтатусыЗаказа.Закрыт;
		Рег.Записать();
		Док = Выборка.ссылка.получитьобъект();
		Док.УстановитьПометкуУдаления(Истина);
	КонецЦикла;
КонецПроцедуры

Функция ПроверитьСуммы(ПараметрыВх, РабочееМесто,СменаКасса)
	номерСмены = ПараметрыВх.НомерСмены;
	СуммаНал = ПараметрыВх.СуммаПриходНал- ПараметрыВх.СуммаВозвратПриходаНал;
	СуммаБНал = ПараметрыВх.СуммаПриходБНал - ПараметрыВх.СуммаВозвратПриходаБНал;
	Сравнилось = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(СУММА(влож.Нал), 0) КАК Нал,
	               |	ЕСТЬNULL(СУММА(влож.БНал), 0) КАК БНал
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ЕСТЬNULL(ВЫБОР
	               |				КОГДА ПротоколРасчетовПротокол.ВариантОплаты = ЗНАЧЕНИЕ(Справочник.ВариантыОплаты.Наличные)
	               |					ТОГДА ВЫБОР
	               |							КОГДА ПротоколРасчетовПротокол.Ссылка.Заказ ССЫЛКА Документ.Заказ
	               |								ТОГДА ПротоколРасчетовПротокол.СуммаФакт
	               |							ИНАЧЕ -1 * ПротоколРасчетовПротокол.СуммаФакт
	               |						КОНЕЦ
	               |				ИНАЧЕ 0
	               |			КОНЕЦ, 0) КАК Нал,
	               |		ЕСТЬNULL(ВЫБОР
	               |				КОГДА ПротоколРасчетовПротокол.ВариантОплаты = ЗНАЧЕНИЕ(Справочник.ВариантыОплаты.Карта)
	               |					ТОГДА ВЫБОР
	               |							КОГДА ПротоколРасчетовПротокол.Ссылка.Заказ ССЫЛКА Документ.Заказ
	               |								ТОГДА ПротоколРасчетовПротокол.СуммаФакт
	               |							ИНАЧЕ -1 * ПротоколРасчетовПротокол.СуммаФакт
	               |						КОНЕЦ
	               |				ИНАЧЕ 0
	               |			КОНЕЦ, 0) КАК БНал
	               |	ИЗ
	               |		Документ.ПротоколРасчетов.Протокол КАК ПротоколРасчетовПротокол
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗаказДопИнф КАК ЗаказДопИнф
	               |			ПО ПротоколРасчетовПротокол.Ссылка.Заказ.Ссылка = ЗаказДопИнф.Заказ
	               |				И (ЗаказДопИнф.Статус = &Закрыт)
	               |	ГДЕ
				   //|		ПротоколРасчетовПротокол.Ссылка.Заказ.НомерСмены = &НомерСмены
				   //|		И ПротоколРасчетовПротокол.Ссылка.Заказ.РабочееМесто = &РабочееМесто
				   |		ПротоколРасчетовПротокол.Ссылка.ККМ = &ККМ
	               |		И ПротоколРасчетовПротокол.Ссылка.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ЕСТЬNULL(ВЫБОР
	               |				КОГДА ПротоколРасчетовПротокол.ВариантОплаты = ЗНАЧЕНИЕ(Справочник.ВариантыОплаты.Наличные)
	               |					ТОГДА ВЫБОР
	               |							КОГДА ПротоколРасчетовПротокол.Ссылка.Заказ ССЫЛКА Документ.Заказ
	               |								ТОГДА ПротоколРасчетовПротокол.СуммаФакт
	               |							ИНАЧЕ -1 * ПротоколРасчетовПротокол.СуммаФакт
	               |						КОНЕЦ
	               |				ИНАЧЕ 0
	               |			КОНЕЦ, 0),
	               |		ЕСТЬNULL(ВЫБОР
	               |				КОГДА ПротоколРасчетовПротокол.ВариантОплаты = ЗНАЧЕНИЕ(Справочник.ВариантыОплаты.Карта)
	               |					ТОГДА ВЫБОР
	               |							КОГДА ПротоколРасчетовПротокол.Ссылка.Заказ ССЫЛКА Документ.Заказ
	               |								ТОГДА ПротоколРасчетовПротокол.СуммаФакт
	               |							ИНАЧЕ -1 * ПротоколРасчетовПротокол.СуммаФакт
	               |						КОНЕЦ
	               |				ИНАЧЕ 0
	               |			КОНЕЦ, 0)
	               |	ИЗ
	               |		Документ.ПротоколРасчетов.Протокол КАК ПротоколРасчетовПротокол
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВозвратДопИнф КАК ВозвратДопИнф
	               |			ПО ПротоколРасчетовПротокол.Ссылка.Заказ.Ссылка = ВозвратДопИнф.Возврат
	               |				И (ВозвратДопИнф.Статус = &Закрыт)
	               |	ГДЕ
				   //|		ПротоколРасчетовПротокол.Ссылка.Заказ.НомерСмены = &НомерСмены
				   //|		И ПротоколРасчетовПротокол.Ссылка.Заказ.РабочееМесто = &РабочееМесто
				   |		ПротоколРасчетовПротокол.Ссылка.ККМ = &ККМ
	               |		И ПротоколРасчетовПротокол.Ссылка.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)) КАК влож";
	Запрос.УстановитьПараметр("НомерСмены",номерСмены);
	//Запрос.УстановитьПараметр("РабочееМесто",РабочееМесто);
	Запрос.УстановитьПараметр("Дата",СменаКасса.Дата);
	Запрос.УстановитьПараметр("ККМ",СменаКасса.Касса);
	Запрос.УстановитьПараметр("Закрыт",Перечисления.СтатусыЗаказа.Закрыт);
	Выборка = Запрос.Выполнить().Выбрать();
	СуммаТТ = 0;
	Пока Выборка.Следующий() Цикл
		СуммаТТ = СуммаТТ + Выборка.Нал + Выборка.БНал;
		Если Выборка.Нал = Окр(СуммаНал,2) и Выборка.БНал = Окр(СуммаБНал,2) Тогда
			Сравнилось = Истина;
		КонецЕсли;
	КонецЦикла;
	Если не Сравнилось Тогда // отправим почту
		ТекстПисьма = "Ошибка закрытия кассовой смены ТТ " + РабочееМесто + ". " + Символы.ПС + "Расхождения в суммах: Сумма по Документам ТТ - " + СуммаТТ + "." + Символы.ПС;
		ТекстПисьма = ТекстПисьма + "Сумма по ККМ - " + Окр((СуммаНал + СуммаБНал),2) + ".";
		Получатели = "disp_cto_kc@myasnov.ru;dez.admin.SUP@coolclever.ru";
		ЭлектроннаяПочта.ОтправитьОповещениеНаПочту("Ошибка закрытия ККМ",ТекстПисьма,Получатели);
	КонецЕсли;
	Возврат Сравнилось;
КонецФункции

&НаКлиенте
Функция ОтчетБезГашения() Экспорт
	
	Если глПараметрыРМ.ККМЕстьДоп Тогда
		МассивЮрЛиц = Новый Массив;
		МассивЮрЛиц.Добавить(глПараметрыРМ.ККМ.Фирма);
		МассивЮрЛиц.Добавить(глПараметрыРМ.ККМСписокДоп[0].Значение.Фирма);
		ВыбЗначение = ИнтерфейсРМ.ВыборИзСписка(МассивЮрЛиц);
		Индекс = МассивЮрЛиц.Найти(ВыбЗначение);
	Иначе 
		Индекс = 0;
	КонецЕсли;
	Если Индекс = 0 Тогда
		ККМ=глПараметрыРМ.ККМ.ПолучитьОбъект();
	Иначе
		ККМ = глПараметрыРМ.ККМСписокДоп[0].Значение.ПолучитьОбъект();
	КонецЕсли;
	Обработка_ККМ=Обработка_ККМ;
	ИнициализацияТО(ККМ,Обработка_ККМ,глПараметрыРМ);
	ВхПараметры = новый Структура;
	ВыхПараметры = новый Структура;
	
	Попытка
		Ответ = Обработка_ККМ.ВыполнитьКоманду("НапечататьОтчетБезГашения",ВхПараметры,ВыхПараметры);
	Исключение
		ИнтерфейсРМ.ВопросПредупреждение("Ошибка", "Ошибка ККМ", ОписаниеОшибки(), "","ОК", "");
		Возврат Ложь;
	КонецПопытки;
	
	
	Если не Ответ Тогда
		Если ВыхПараметры.Свойство("ОписаниеОшибки") Тогда
			ТекстОшибки = "";
			ОписаниеОшибки = ВыхПараметры.ОписаниеОшибки;
			Для к = 0 по ОписаниеОшибки.Количество()-1 Цикл
				 ТекстОшибки = ТекстОшибки + ОписаниеОшибки[к];
			КонецЦикла;
			ИнтерфейсРМ.ВопросПредупреждение("Ошибка Открытия смены",ТекстОшибки,"","","ОК","");
		КонецЕсли;
	КонецЕсли;
КонецФункции

&НаКлиенте
Функция ЭтоПерваяКассоваяСмена()
	
	Перем Выборка, Запрос;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КОЛИЧЕСТВО(Касса_ОткрытиеСмены.Ссылка) КАК Ссылка
	|ИЗ
	|	Документ.Касса_ОткрытиеСмены КАК Касса_ОткрытиеСмены
	|ГДЕ
	|	Касса_ОткрытиеСмены.РабочееМесто = &РабочееМесто
	|	И Касса_ОткрытиеСмены.Дата МЕЖДУ Началопериода(&Дата,День) И Конецпериода(&Дата,День)";
	Запрос.УстановитьПараметр("РабочееМесто",глРабочееМесто);
	Запрос.УстановитьПараметр("Дата",ТекущаяДата());
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка <> 1 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
КонецФункции
